Revit 2024 API
BuiltInFailures.EditingFailures.ReloadBeforeMakeEditable Property
 You must Reload Latest before editing the element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ReloadBeforeMakeEditable { get; }
Visual Basic
Public Shared ReadOnly Property ReloadBeforeMakeEditable As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ReloadBeforeMakeEditable {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace